linkid-sdk-ws/src/test/resources/test-ws-security-username-token-invalid-message.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
               soap:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"
               xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/                http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Header>
        <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
                       xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" soap:mustUnderstand="1">
            <wsse:UsernameToken wsu:Id="UsernameToken-2">
                <wsse:Username>foo</wsse:Username>
                <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordDigest">k0V9e16YW1AbTudj7RKYyq2/w/8=</wsse:Password>
                <wsse:Nonce EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary">sWbgd6LIpLsreyT7bPSwOQ==</wsse:Nonce>
                <wsu:Created>2010-01-22T12:45:45.720Z</wsu:Created>
            </wsse:UsernameToken>
        </wsse:Security>
        <tns:header xmlns:tns="urn:test" Id="test-id" soap:mustUnderstand="1">
            Hello World
        </tns:header>
    </soap:Header>
    <soap:Body>
        <tns:root xmlns:tns="urn:test">Hello World</tns:root>
    </soap:Body>
</soap:Envelope>